let funcData = [
  {
    "typeId": 1,
    "typeName": "解盾",
    "data": [
      {
        "id": 1,
        "name": "無視拼圖盾"
      },
      {
        "id": 2,
        "name": "無視固定連擊盾"
      },
      {
        "id": 3,
        "name": "無視連擊相等盾"
      },
      {
        "id": 4,
        "name": "無視二屬盾"
      },
      {
        "id": 5,
        "name": "無視三屬盾"
      },
      {
        "id": 6,
        "name": "無視四屬盾"
      },
      {
        "id": 7,
        "name": "無視五屬盾"
      },
      {
        "id": 8,
        "name": "無視十字盾"
      },
      {
        "id": 9,
        "name": "無視符石連擊零化"
      },
      {
        "id": 10,
        "name": "無視攻前盾"
      },
      {
        "id": 11,
        "name": "無視反首消盾"
      },
      {
        "id": 12,
        "name": "無視指定減傷抗性"
      },
      {
        "id": 13,
        "name": "無視全消盾"
      },
      {
        "id": 14,
        "name": "無視指定連擊法印"
      }
    ]
  },
  {
    "typeId": 2,
    "typeName": "功能",
    "data": [
      {
        "id": 15,
        "name": "加combo"
      },
      {
        "id": 16,
        "name": "儲滿龍脈儀"
      },
      {
        "id": 17,
        "name": "攻前砲擊"
      },
      {
        "id": 18,
        "name": "攻擊力提升"
      },
      {
        "id": 19,
        "name": "回復力提升"
      },
      {
        "id": 20,
        "name": "回血"
      },
      {
        "id": 21,
        "name": "減傷"
      }
    ]
  },
  {
    "typeId": 3,
    "typeName": "頭像狀態",
    "data": [
      {
        "id": 22,
        "name": "自身亢奮"
      },
      {
        "id": 23,
        "name": "自身解疲憊"
      },
      {
        "id": 24,
        "name": "自身解麻痺"
      },
      {
        "id": 25,
        "name": "自身解休眠"
      },
      {
        "id": 26,
        "name": "自身解風壓"
      }
    ]
  },
  {
    "typeId": 4,
    "typeName": "速攻",
    "data": [
      {
        "id": 27,
        "name": "自身減CD"
      },
      {
        "id": 28,
        "name": "自身減CD(人)"
      },
      {
        "id": 29,
        "name": "自身減CD(神)"
      },
      {
        "id": 30,
        "name": "自身減CD(魔)"
      },
      {
        "id": 31,
        "name": "自身減CD(獸)"
      },
      {
        "id": 32,
        "name": "自身減CD(龍)"
      },
      {
        "id": 33,
        "name": "自身減CD(機)"
      },
      {
        "id": 34,
        "name": "自身減CD(妖)"
      },
      {
        "id": 35,
        "name": "自身+EP"
      }
    ]
  },
  {
    "typeId": 5,
    "typeName": "追打",
    "data": [
      {
        "id": 36,
        "name": "自身水屬追打"
      },
      {
        "id": 37,
        "name": "自身火屬追打"
      },
      {
        "id": 38,
        "name": "自身木屬追打"
      },
      {
        "id": 39,
        "name": "自身光屬追打"
      },
      {
        "id": 40,
        "name": "自身暗屬追打"
      },
      {
        "id": 41,
        "name": "自身無屬追打"
      },
      {
        "id": 42,
        "name": "自身五屬追打"
      },
      {
        "id": 43,
        "name": "全隊水屬追打"
      },
      {
        "id": 44,
        "name": "全隊火屬追打"
      },
      {
        "id": 45,
        "name": "全隊木屬追打"
      },
      {
        "id": 46,
        "name": "全隊光屬追打"
      },
      {
        "id": 47,
        "name": "全隊暗屬追打"
      },
      {
        "id": 48,
        "name": "全隊無屬追打"
      },
      {
        "id": 49,
        "name": "全隊五屬追打"
      }
    ]
  },
  {
    "typeId": 6,
    "typeName": "抗性",
    "data": [
      {
        "id": 50,
        "name": "無視燃燒"
      },
      {
        "id": 51,
        "name": "無視黏腐"
      },
      {
        "id": 52,
        "name": "防鎖"
      },
      {
        "id": 53,
        "name": "防爆破炸彈"
      },
      {
        "id": 54,
        "name": "灼熱減傷"
      }
    ]
  },
  {
    "typeId": 7,
    "typeName": "轉珠",
    "data": [
      {
        "id": 55,
        "name": "自身直行轉水"
      },
      {
        "id": 56,
        "name": "自身直行轉火"
      },
      {
        "id": 57,
        "name": "自身直行轉木"
      },
      {
        "id": 58,
        "name": "自身直行轉光"
      },
      {
        "id": 59,
        "name": "自身直行轉暗"
      },
      {
        "id": 60,
        "name": "其他轉版"
      }
    ]
  }
] ;
module.exports = funcData;